nsec/nsec-badge/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
# Defaults common to all firmwares
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
CONFIG_RMT_ISR_IRAM_SAFE=y

# Enable the console and logging on the USB port
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
